apache/nuttx/boards/arm/stm32f4/stm32f411-minimum/src/stm32f411-minimum-gpio.h
/****************************************************************************
 * boards/arm/stm32f4/stm32f411-minimum/src/stm32f411-minimum-gpio.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __BOARDS_ARM_STM32_STM32F411_MINIMUM_SRC_STM32F411_MINIMUM_GPIO_H
#define __BOARDS_ARM_STM32_STM32F411_MINIMUM_SRC_STM32F411_MINIMUM_GPIO_H

/* GPIO A0 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A0_OUT)
#  define GPIO_A0_USED_OUT 1
#  define GPIO_A0_USED_INT 0
#  define GPIO_A0_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A0_INT)
#  define GPIO_A0_USED_OUT 0
#  define GPIO_A0_USED_INT 1
#  define GPIO_A0_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A0_IN)
#  define GPIO_A0_USED_OUT 0
#  define GPIO_A0_USED_INT 0
#  define GPIO_A0_USED_IN 1
#else
#  define GPIO_A0_USED_OUT 0
#  define GPIO_A0_USED_INT 0
#  define GPIO_A0_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A0_OUT_PP)
#  define GPIO_A0_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A0_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A0_OUT_CLEAR)
#  define GPIO_A0_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A0_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A0_PULL_DOWN)
#  define GPIO_A0_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A0_PULL_FLOAT)
#  define GPIO_A0_PULL GPIO_FLOAT
#else
#  define GPIO_A0_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A0_SPEED_2MHz)
#  define GPIO_A0_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A0_SPEED_25MHz)
#  define GPIO_A0_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A0_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A1 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A1_OUT)
#  define GPIO_A1_USED_OUT 1
#  define GPIO_A1_USED_INT 0
#  define GPIO_A1_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A1_INT)
#  define GPIO_A1_USED_OUT 0
#  define GPIO_A1_USED_INT 1
#  define GPIO_A1_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A1_IN)
#  define GPIO_A1_USED_OUT 0
#  define GPIO_A1_USED_INT 0
#  define GPIO_A1_USED_IN 1
#else
#  define GPIO_A1_USED_OUT 0
#  define GPIO_A1_USED_INT 0
#  define GPIO_A1_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A1_OUT_PP)
#  define GPIO_A1_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A1_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A1_OUT_CLEAR)
#  define GPIO_A1_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A1_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A1_PULL_DOWN)
#  define GPIO_A1_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A1_PULL_FLOAT)
#  define GPIO_A1_PULL GPIO_FLOAT
#else
#  define GPIO_A1_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A1_SPEED_2MHz)
#  define GPIO_A1_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A1_SPEED_25MHz)
#  define GPIO_A1_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A1_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A2 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A2_OUT)
#  define GPIO_A2_USED_OUT 1
#  define GPIO_A2_USED_INT 0
#  define GPIO_A2_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A2_INT)
#  define GPIO_A2_USED_OUT 0
#  define GPIO_A2_USED_INT 1
#  define GPIO_A2_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A2_IN)
#  define GPIO_A2_USED_OUT 0
#  define GPIO_A2_USED_INT 0
#  define GPIO_A2_USED_IN 1
#else
#  define GPIO_A2_USED_OUT 0
#  define GPIO_A2_USED_INT 0
#  define GPIO_A2_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A2_OUT_PP)
#  define GPIO_A2_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A2_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A2_OUT_CLEAR)
#  define GPIO_A2_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A2_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A2_PULL_DOWN)
#  define GPIO_A2_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A2_PULL_FLOAT)
#  define GPIO_A2_PULL GPIO_FLOAT
#else
#  define GPIO_A2_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A2_SPEED_2MHz)
#  define GPIO_A2_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A2_SPEED_25MHz)
#  define GPIO_A2_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A2_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A3 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A3_OUT)
#  define GPIO_A3_USED_OUT 1
#  define GPIO_A3_USED_INT 0
#  define GPIO_A3_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A3_INT)
#  define GPIO_A3_USED_OUT 0
#  define GPIO_A3_USED_INT 1
#  define GPIO_A3_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A3_IN)
#  define GPIO_A3_USED_OUT 0
#  define GPIO_A3_USED_INT 0
#  define GPIO_A3_USED_IN 1
#else
#  define GPIO_A3_USED_OUT 0
#  define GPIO_A3_USED_INT 0
#  define GPIO_A3_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A3_OUT_PP)
#  define GPIO_A3_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A3_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A3_OUT_CLEAR)
#  define GPIO_A3_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A3_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

