apache/nuttx/boards/arm/stm32f4/stm32f411-minimum/src/stm32f411-minimum-gpio.h
#if defined(CONFIG_STM32F411MINIMUM_GPIO_A8_OUT_CLEAR)
#  define GPIO_A8_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A8_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A8_PULL_DOWN)
#  define GPIO_A8_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A8_PULL_FLOAT)
#  define GPIO_A8_PULL GPIO_FLOAT
#else
#  define GPIO_A8_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A8_SPEED_2MHz)
#  define GPIO_A8_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A8_SPEED_25MHz)
#  define GPIO_A8_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A8_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A9 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A9_OUT)
#  define GPIO_A9_USED_OUT 1
#  define GPIO_A9_USED_INT 0
#  define GPIO_A9_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A9_INT)
#  define GPIO_A9_USED_OUT 0
#  define GPIO_A9_USED_INT 1
#  define GPIO_A9_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A9_IN)
#  define GPIO_A9_USED_OUT 0
#  define GPIO_A9_USED_INT 0
#  define GPIO_A9_USED_IN 1
#else
#  define GPIO_A9_USED_OUT 0
#  define GPIO_A9_USED_INT 0
#  define GPIO_A9_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A9_OUT_PP)
#  define GPIO_A9_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A9_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A9_OUT_CLEAR)
#  define GPIO_A9_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A9_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A9_PULL_DOWN)
#  define GPIO_A9_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A9_PULL_FLOAT)
#  define GPIO_A9_PULL GPIO_FLOAT
#else
#  define GPIO_A9_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A9_SPEED_2MHz)
#  define GPIO_A9_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A9_SPEED_25MHz)
#  define GPIO_A9_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A9_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A10 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A10_OUT)
#  define GPIO_A10_USED_OUT 1
#  define GPIO_A10_USED_INT 0
#  define GPIO_A10_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A10_INT)
#  define GPIO_A10_USED_OUT 0
#  define GPIO_A10_USED_INT 1
#  define GPIO_A10_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A10_IN)
#  define GPIO_A10_USED_OUT 0
#  define GPIO_A10_USED_INT 0
#  define GPIO_A10_USED_IN 1
#else
#  define GPIO_A10_USED_OUT 0
#  define GPIO_A10_USED_INT 0
#  define GPIO_A10_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A10_OUT_PP)
#  define GPIO_A10_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A10_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A10_OUT_CLEAR)
#  define GPIO_A10_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A10_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A10_PULL_DOWN)
#  define GPIO_A10_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A10_PULL_FLOAT)
#  define GPIO_A10_PULL GPIO_FLOAT
#else
#  define GPIO_A10_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A10_SPEED_2MHz)
#  define GPIO_A10_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A10_SPEED_25MHz)
#  define GPIO_A10_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A10_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A11 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A11_OUT)
#  define GPIO_A11_USED_OUT 1
#  define GPIO_A11_USED_INT 0
#  define GPIO_A11_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A11_INT)
#  define GPIO_A11_USED_OUT 0
#  define GPIO_A11_USED_INT 1
#  define GPIO_A11_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A11_IN)
#  define GPIO_A11_USED_OUT 0
#  define GPIO_A11_USED_INT 0
#  define GPIO_A11_USED_IN 1
#else
#  define GPIO_A11_USED_OUT 0
#  define GPIO_A11_USED_INT 0
#  define GPIO_A11_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A11_OUT_PP)
#  define GPIO_A11_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A11_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A11_OUT_CLEAR)
#  define GPIO_A11_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A11_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A11_PULL_DOWN)
#  define GPIO_A11_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A11_PULL_FLOAT)
#  define GPIO_A11_PULL GPIO_FLOAT
#else
#  define GPIO_A11_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A11_SPEED_2MHz)
#  define GPIO_A11_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A11_SPEED_25MHz)
#  define GPIO_A11_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A11_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A12 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A12_OUT)
#  define GPIO_A12_USED_OUT 1
#  define GPIO_A12_USED_INT 0
#  define GPIO_A12_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A12_INT)
#  define GPIO_A12_USED_OUT 0
#  define GPIO_A12_USED_INT 1
#  define GPIO_A12_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A12_IN)
#  define GPIO_A12_USED_OUT 0
#  define GPIO_A12_USED_INT 0
#  define GPIO_A12_USED_IN 1
#else
#  define GPIO_A12_USED_OUT 0
#  define GPIO_A12_USED_INT 0
#  define GPIO_A12_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A12_OUT_PP)
#  define GPIO_A12_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A12_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A12_OUT_CLEAR)
#  define GPIO_A12_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A12_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A12_PULL_DOWN)
#  define GPIO_A12_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A12_PULL_FLOAT)
#  define GPIO_A12_PULL GPIO_FLOAT
#else
#  define GPIO_A12_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A12_SPEED_2MHz)
#  define GPIO_A12_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A12_SPEED_25MHz)
#  define GPIO_A12_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A12_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO A15 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A15_OUT)
#  define GPIO_A15_USED_OUT 1
#  define GPIO_A15_USED_INT 0
#  define GPIO_A15_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A15_INT)
#  define GPIO_A15_USED_OUT 0
#  define GPIO_A15_USED_INT 1
#  define GPIO_A15_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A15_IN)
#  define GPIO_A15_USED_OUT 0
#  define GPIO_A15_USED_INT 0
#  define GPIO_A15_USED_IN 1
#else
#  define GPIO_A15_USED_OUT 0
#  define GPIO_A15_USED_INT 0
#  define GPIO_A15_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A15_OUT_PP)
#  define GPIO_A15_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_A15_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A15_OUT_CLEAR)
#  define GPIO_A15_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_A15_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A15_PULL_DOWN)
#  define GPIO_A15_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A15_PULL_FLOAT)
#  define GPIO_A15_PULL GPIO_FLOAT
#else
#  define GPIO_A15_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_A15_SPEED_2MHz)
#  define GPIO_A15_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_A15_SPEED_25MHz)
#  define GPIO_A15_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_A15_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B0 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B0_OUT)
#  define GPIO_B0_USED_OUT 1
#  define GPIO_B0_USED_INT 0
#  define GPIO_B0_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B0_INT)
#  define GPIO_B0_USED_OUT 0
#  define GPIO_B0_USED_INT 1
#  define GPIO_B0_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B0_IN)
#  define GPIO_B0_USED_OUT 0
#  define GPIO_B0_USED_INT 0
#  define GPIO_B0_USED_IN 1
#else
#  define GPIO_B0_USED_OUT 0
#  define GPIO_B0_USED_INT 0
#  define GPIO_B0_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B0_OUT_PP)
#  define GPIO_B0_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B0_OUTTYPE GPIO_OPENDRAIN
#endif

