apache/nuttx/boards/arm/stm32f4/stm32f411-minimum/src/stm32f411-minimum-gpio.h
#if defined(CONFIG_STM32F411MINIMUM_GPIO_B5_OUT)
#  define GPIO_B5_USED_OUT 1
#  define GPIO_B5_USED_INT 0
#  define GPIO_B5_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B5_INT)
#  define GPIO_B5_USED_OUT 0
#  define GPIO_B5_USED_INT 1
#  define GPIO_B5_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B5_IN)
#  define GPIO_B5_USED_OUT 0
#  define GPIO_B5_USED_INT 0
#  define GPIO_B5_USED_IN 1
#else
#  define GPIO_B5_USED_OUT 0
#  define GPIO_B5_USED_INT 0
#  define GPIO_B5_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B5_OUT_PP)
#  define GPIO_B5_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B5_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B5_OUT_CLEAR)
#  define GPIO_B5_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B5_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B5_PULL_DOWN)
#  define GPIO_B5_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B5_PULL_FLOAT)
#  define GPIO_B5_PULL GPIO_FLOAT
#else
#  define GPIO_B5_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B5_SPEED_2MHz)
#  define GPIO_B5_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B5_SPEED_25MHz)
#  define GPIO_B5_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B5_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B6 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B6_OUT)
#  define GPIO_B6_USED_OUT 1
#  define GPIO_B6_USED_INT 0
#  define GPIO_B6_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B6_INT)
#  define GPIO_B6_USED_OUT 0
#  define GPIO_B6_USED_INT 1
#  define GPIO_B6_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B6_IN)
#  define GPIO_B6_USED_OUT 0
#  define GPIO_B6_USED_INT 0
#  define GPIO_B6_USED_IN 1
#else
#  define GPIO_B6_USED_OUT 0
#  define GPIO_B6_USED_INT 0
#  define GPIO_B6_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B6_OUT_PP)
#  define GPIO_B6_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B6_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B6_OUT_CLEAR)
#  define GPIO_B6_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B6_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B6_PULL_DOWN)
#  define GPIO_B6_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B6_PULL_FLOAT)
#  define GPIO_B6_PULL GPIO_FLOAT
#else
#  define GPIO_B6_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B6_SPEED_2MHz)
#  define GPIO_B6_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B6_SPEED_25MHz)
#  define GPIO_B6_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B6_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B7 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B7_OUT)
#  define GPIO_B7_USED_OUT 1
#  define GPIO_B7_USED_INT 0
#  define GPIO_B7_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B7_INT)
#  define GPIO_B7_USED_OUT 0
#  define GPIO_B7_USED_INT 1
#  define GPIO_B7_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B7_IN)
#  define GPIO_B7_USED_OUT 0
#  define GPIO_B7_USED_INT 0
#  define GPIO_B7_USED_IN 1
#else
#  define GPIO_B7_USED_OUT 0
#  define GPIO_B7_USED_INT 0
#  define GPIO_B7_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B7_OUT_PP)
#  define GPIO_B7_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B7_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B7_OUT_CLEAR)
#  define GPIO_B7_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B7_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B7_PULL_DOWN)
#  define GPIO_B7_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B7_PULL_FLOAT)
#  define GPIO_B7_PULL GPIO_FLOAT
#else
#  define GPIO_B7_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B7_SPEED_2MHz)
#  define GPIO_B7_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B7_SPEED_25MHz)
#  define GPIO_B7_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B7_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B8 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B8_OUT)
#  define GPIO_B8_USED_OUT 1
#  define GPIO_B8_USED_INT 0
#  define GPIO_B8_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B8_INT)
#  define GPIO_B8_USED_OUT 0
#  define GPIO_B8_USED_INT 1
#  define GPIO_B8_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B8_IN)
#  define GPIO_B8_USED_OUT 0
#  define GPIO_B8_USED_INT 0
#  define GPIO_B8_USED_IN 1
#else
#  define GPIO_B8_USED_OUT 0
#  define GPIO_B8_USED_INT 0
#  define GPIO_B8_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B8_OUT_PP)
#  define GPIO_B8_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B8_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B8_OUT_CLEAR)
#  define GPIO_B8_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B8_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B8_PULL_DOWN)
#  define GPIO_B8_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B8_PULL_FLOAT)
#  define GPIO_B8_PULL GPIO_FLOAT
#else
#  define GPIO_B8_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B8_SPEED_2MHz)
#  define GPIO_B8_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B8_SPEED_25MHz)
#  define GPIO_B8_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B8_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B9 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B9_OUT)
#  define GPIO_B9_USED_OUT 1
#  define GPIO_B9_USED_INT 0
#  define GPIO_B9_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B9_INT)
#  define GPIO_B9_USED_OUT 0
#  define GPIO_B9_USED_INT 1
#  define GPIO_B9_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B9_IN)
#  define GPIO_B9_USED_OUT 0
#  define GPIO_B9_USED_INT 0
#  define GPIO_B9_USED_IN 1
#else
#  define GPIO_B9_USED_OUT 0
#  define GPIO_B9_USED_INT 0
#  define GPIO_B9_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B9_OUT_PP)
#  define GPIO_B9_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B9_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B9_OUT_CLEAR)
#  define GPIO_B9_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B9_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B9_PULL_DOWN)
#  define GPIO_B9_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B9_PULL_FLOAT)
#  define GPIO_B9_PULL GPIO_FLOAT
#else
#  define GPIO_B9_PULL GPIO_PULLUP
#endif

