apache/nuttx/boards/arm/stm32f4/stm32f411-minimum/src/stm32f411-minimum-gpio.h
#if defined(CONFIG_STM32F411MINIMUM_GPIO_B9_SPEED_2MHz)
#  define GPIO_B9_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B9_SPEED_25MHz)
#  define GPIO_B9_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B9_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B10 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B10_OUT)
#  define GPIO_B10_USED_OUT 1
#  define GPIO_B10_USED_INT 0
#  define GPIO_B10_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B10_INT)
#  define GPIO_B10_USED_OUT 0
#  define GPIO_B10_USED_INT 1
#  define GPIO_B10_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B10_IN)
#  define GPIO_B10_USED_OUT 0
#  define GPIO_B10_USED_INT 0
#  define GPIO_B10_USED_IN 1
#else
#  define GPIO_B10_USED_OUT 0
#  define GPIO_B10_USED_INT 0
#  define GPIO_B10_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B10_OUT_PP)
#  define GPIO_B10_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B10_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B10_OUT_CLEAR)
#  define GPIO_B10_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B10_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B10_PULL_DOWN)
#  define GPIO_B10_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B10_PULL_FLOAT)
#  define GPIO_B10_PULL GPIO_FLOAT
#else
#  define GPIO_B10_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B10_SPEED_2MHz)
#  define GPIO_B10_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B10_SPEED_25MHz)
#  define GPIO_B10_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B10_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B12 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B12_OUT)
#  define GPIO_B12_USED_OUT 1
#  define GPIO_B12_USED_INT 0
#  define GPIO_B12_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B12_INT)
#  define GPIO_B12_USED_OUT 0
#  define GPIO_B12_USED_INT 1
#  define GPIO_B12_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B12_IN)
#  define GPIO_B12_USED_OUT 0
#  define GPIO_B12_USED_INT 0
#  define GPIO_B12_USED_IN 1
#else
#  define GPIO_B12_USED_OUT 0
#  define GPIO_B12_USED_INT 0
#  define GPIO_B12_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B12_OUT_PP)
#  define GPIO_B12_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B12_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B12_OUT_CLEAR)
#  define GPIO_B12_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B12_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B12_PULL_DOWN)
#  define GPIO_B12_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B12_PULL_FLOAT)
#  define GPIO_B12_PULL GPIO_FLOAT
#else
#  define GPIO_B12_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B12_SPEED_2MHz)
#  define GPIO_B12_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B12_SPEED_25MHz)
#  define GPIO_B12_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B12_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B13 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B13_OUT)
#  define GPIO_B13_USED_OUT 1
#  define GPIO_B13_USED_INT 0
#  define GPIO_B13_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B13_INT)
#  define GPIO_B13_USED_OUT 0
#  define GPIO_B13_USED_INT 1
#  define GPIO_B13_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B13_IN)
#  define GPIO_B13_USED_OUT 0
#  define GPIO_B13_USED_INT 0
#  define GPIO_B13_USED_IN 1
#else
#  define GPIO_B13_USED_OUT 0
#  define GPIO_B13_USED_INT 0
#  define GPIO_B13_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B13_OUT_PP)
#  define GPIO_B13_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B13_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B13_OUT_CLEAR)
#  define GPIO_B13_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B13_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B13_PULL_DOWN)
#  define GPIO_B13_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B13_PULL_FLOAT)
#  define GPIO_B13_PULL GPIO_FLOAT
#else
#  define GPIO_B13_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B13_SPEED_2MHz)
#  define GPIO_B13_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B13_SPEED_25MHz)
#  define GPIO_B13_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B13_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B14 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B14_OUT)
#  define GPIO_B14_USED_OUT 1
#  define GPIO_B14_USED_INT 0
#  define GPIO_B14_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B14_INT)
#  define GPIO_B14_USED_OUT 0
#  define GPIO_B14_USED_INT 1
#  define GPIO_B14_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B14_IN)
#  define GPIO_B14_USED_OUT 0
#  define GPIO_B14_USED_INT 0
#  define GPIO_B14_USED_IN 1
#else
#  define GPIO_B14_USED_OUT 0
#  define GPIO_B14_USED_INT 0
#  define GPIO_B14_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B14_OUT_PP)
#  define GPIO_B14_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B14_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B14_OUT_CLEAR)
#  define GPIO_B14_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B14_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B14_PULL_DOWN)
#  define GPIO_B14_PULL GPIO_PULLDOWN
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B14_PULL_FLOAT)
#  define GPIO_B14_PULL GPIO_FLOAT
#else
#  define GPIO_B14_PULL GPIO_PULLUP
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B14_SPEED_2MHz)
#  define GPIO_B14_SPEED GPIO_SPEED_2MHz
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B14_SPEED_25MHz)
#  define GPIO_B14_SPEED GPIO_SPEED_25MHz
#else
#  define GPIO_B14_SPEED GPIO_SPEED_50MHz
#endif

/* GPIO B15 Kconfig Mapping */

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B15_OUT)
#  define GPIO_B15_USED_OUT 1
#  define GPIO_B15_USED_INT 0
#  define GPIO_B15_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B15_INT)
#  define GPIO_B15_USED_OUT 0
#  define GPIO_B15_USED_INT 1
#  define GPIO_B15_USED_IN 0
#elif defined(CONFIG_STM32F411MINIMUM_GPIO_B15_IN)
#  define GPIO_B15_USED_OUT 0
#  define GPIO_B15_USED_INT 0
#  define GPIO_B15_USED_IN 1
#else
#  define GPIO_B15_USED_OUT 0
#  define GPIO_B15_USED_INT 0
#  define GPIO_B15_USED_IN 0
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B15_OUT_PP)
#  define GPIO_B15_OUTTYPE GPIO_PUSHPULL
#else
#  define GPIO_B15_OUTTYPE GPIO_OPENDRAIN
#endif

#if defined(CONFIG_STM32F411MINIMUM_GPIO_B15_OUT_CLEAR)
#  define GPIO_B15_OUT_DEFAULT GPIO_OUTPUT_CLEAR
#else
#  define GPIO_B15_OUT_DEFAULT GPIO_OUTPUT_SET
#endif

