apache/nuttx/boards/arm/stm32f4/stm32f411-minimum/src/stm32f411-minimum-gpio.h
/* GPIO_B12 definition */

#define GPIO_B12_OUT (GPIO_OUTPUT|GPIO_B12_OUTTYPE|GPIO_B12_OUT_DEFAULT|\
                      GPIO_B12_PULL|GPIO_B12_SPEED|GPIO_PORTB|GPIO_PIN12)
#define GPIO_B12_IN  (GPIO_INPUT|GPIO_B12_PULL|GPIO_B12_SPEED|\
                      GPIO_PORTB|GPIO_PIN12)
#define GPIO_B12_INT (GPIO_B12_IN|GPIO_EXTI)

/* GPIO_B13 definition */

#define GPIO_B13_OUT (GPIO_OUTPUT|GPIO_B13_OUTTYPE|GPIO_B13_OUT_DEFAULT|\
                      GPIO_B13_PULL|GPIO_B13_SPEED|GPIO_PORTB|GPIO_PIN13)
#define GPIO_B13_IN  (GPIO_INPUT|GPIO_B13_PULL|GPIO_B13_SPEED|\
                      GPIO_PORTB|GPIO_PIN13)
#define GPIO_B13_INT (GPIO_B13_IN|GPIO_EXTI)

/* GPIO_B14 definition */

#define GPIO_B14_OUT (GPIO_OUTPUT|GPIO_B14_OUTTYPE|GPIO_B14_OUT_DEFAULT|\
                      GPIO_B14_PULL|GPIO_B14_SPEED|GPIO_PORTB|GPIO_PIN14)
#define GPIO_B14_IN  (GPIO_INPUT|GPIO_B14_PULL|GPIO_B14_SPEED|\
                      GPIO_PORTB|GPIO_PIN14)
#define GPIO_B14_INT (GPIO_B14_IN|GPIO_EXTI)

/* GPIO_B15 definition */

#define GPIO_B15_OUT (GPIO_OUTPUT|GPIO_B15_OUTTYPE|GPIO_B15_OUT_DEFAULT|\
                      GPIO_B15_PULL|GPIO_B15_SPEED|GPIO_PORTB|GPIO_PIN15)
#define GPIO_B15_IN  (GPIO_INPUT|GPIO_B15_PULL|GPIO_B15_SPEED|\
                      GPIO_PORTB|GPIO_PIN15)
#define GPIO_B15_INT (GPIO_B15_IN|GPIO_EXTI)

/* GPIO_C13 definition */

#define GPIO_C13_OUT (GPIO_OUTPUT|GPIO_C13_OUTTYPE|GPIO_C13_OUT_DEFAULT|\
                      GPIO_C13_PULL|GPIO_C13_SPEED|GPIO_PORTC|GPIO_PIN13)
#define GPIO_C13_IN  (GPIO_INPUT|GPIO_C13_PULL|GPIO_C13_SPEED|\
                      GPIO_PORTC|GPIO_PIN13)
#define GPIO_C13_INT (GPIO_C13_IN|GPIO_EXTI)

/* GPIO_C14 definition */

#define GPIO_C14_OUT (GPIO_OUTPUT|GPIO_C14_OUTTYPE|GPIO_C14_OUT_DEFAULT|\
                      GPIO_C14_PULL|GPIO_C14_SPEED|GPIO_PORTC|GPIO_PIN14)
#define GPIO_C14_IN  (GPIO_INPUT|GPIO_C14_PULL|GPIO_C14_SPEED|\
                      GPIO_PORTC|GPIO_PIN14)
#define GPIO_C14_INT (GPIO_C14_IN|GPIO_EXTI)

/* GPIO_C15 definition */

#define GPIO_C15_OUT (GPIO_OUTPUT|GPIO_C15_OUTTYPE|GPIO_C15_OUT_DEFAULT|\
                      GPIO_C15_PULL|GPIO_C15_SPEED|GPIO_PORTC|GPIO_PIN15)
#define GPIO_C15_IN  (GPIO_INPUT|GPIO_C15_PULL|GPIO_C15_SPEED|\
                      GPIO_PORTC|GPIO_PIN15)
#define GPIO_C15_INT (GPIO_C15_IN|GPIO_EXTI)

#define BOARD_NGPIO_OUT \
  GPIO_A0_USED_OUT + \
  GPIO_A1_USED_OUT + \
  GPIO_A2_USED_OUT + \
  GPIO_A3_USED_OUT + \
  GPIO_A4_USED_OUT + \
  GPIO_A5_USED_OUT + \
  GPIO_A6_USED_OUT + \
  GPIO_A7_USED_OUT + \
  GPIO_A8_USED_OUT + \
  GPIO_A9_USED_OUT + \
  GPIO_A10_USED_OUT + \
  GPIO_A11_USED_OUT + \
  GPIO_A12_USED_OUT + \
  GPIO_A15_USED_OUT + \
  GPIO_B0_USED_OUT + \
  GPIO_B1_USED_OUT + \
  GPIO_B2_USED_OUT + \
  GPIO_B3_USED_OUT + \
  GPIO_B4_USED_OUT + \
  GPIO_B5_USED_OUT + \
  GPIO_B6_USED_OUT + \
  GPIO_B7_USED_OUT + \
  GPIO_B8_USED_OUT + \
  GPIO_B9_USED_OUT + \
  GPIO_B10_USED_OUT + \
  GPIO_B12_USED_OUT + \
  GPIO_B13_USED_OUT + \
  GPIO_B14_USED_OUT + \
  GPIO_B15_USED_OUT + \
  GPIO_C13_USED_OUT + \
  GPIO_C14_USED_OUT + \
  GPIO_C15_USED_OUT

#define BOARD_NGPIO_IN \
  GPIO_A0_USED_IN + \
  GPIO_A1_USED_IN + \
  GPIO_A2_USED_IN + \
  GPIO_A3_USED_IN + \
  GPIO_A4_USED_IN + \
  GPIO_A5_USED_IN + \
  GPIO_A6_USED_IN + \
  GPIO_A7_USED_IN + \
  GPIO_A8_USED_IN + \
  GPIO_A9_USED_IN + \
  GPIO_A10_USED_IN + \
  GPIO_A11_USED_IN + \
  GPIO_A12_USED_IN + \
  GPIO_A15_USED_IN + \
  GPIO_B0_USED_IN + \
  GPIO_B1_USED_IN + \
  GPIO_B2_USED_IN + \
  GPIO_B3_USED_IN + \
  GPIO_B4_USED_IN + \
  GPIO_B5_USED_IN + \
  GPIO_B6_USED_IN + \
  GPIO_B7_USED_IN + \
  GPIO_B8_USED_IN + \
  GPIO_B9_USED_IN + \
  GPIO_B10_USED_IN + \
  GPIO_B12_USED_IN + \
  GPIO_B13_USED_IN + \
  GPIO_B14_USED_IN + \
  GPIO_B15_USED_IN + \
  GPIO_C13_USED_IN + \
  GPIO_C14_USED_IN + \
  GPIO_C15_USED_IN

#define BOARD_NGPIO_INT \
  GPIO_A0_USED_INT + \
  GPIO_A1_USED_INT + \
  GPIO_A2_USED_INT + \
  GPIO_A3_USED_INT + \
  GPIO_A4_USED_INT + \
  GPIO_A5_USED_INT + \
  GPIO_A6_USED_INT + \
  GPIO_A7_USED_INT + \
  GPIO_A8_USED_INT + \
  GPIO_A9_USED_INT + \
  GPIO_A10_USED_INT + \
  GPIO_A11_USED_INT + \
  GPIO_A12_USED_INT + \
  GPIO_A15_USED_INT + \
  GPIO_B0_USED_INT + \
  GPIO_B1_USED_INT + \
  GPIO_B2_USED_INT + \
  GPIO_B3_USED_INT + \
  GPIO_B4_USED_INT + \
  GPIO_B5_USED_INT + \
  GPIO_B6_USED_INT + \
  GPIO_B7_USED_INT + \
  GPIO_B8_USED_INT + \
  GPIO_B9_USED_INT + \
  GPIO_B10_USED_INT + \
  GPIO_B12_USED_INT + \
  GPIO_B13_USED_INT + \
  GPIO_B14_USED_INT + \
  GPIO_B15_USED_INT + \
  GPIO_C13_USED_INT + \
  GPIO_C14_USED_INT + \
  GPIO_C15_USED_INT

#if BOARD_NGPIO_INT > CONFIG_DEV_GPIO_NSIGNALS
#  error You have enabled more interrupts than supported, adjust CONFIG_DEV_GPIO_NSIGNALS to support them all
#endif

#endif /* __BOARDS_ARM_STM32_STM32F411_MINIMUM_SRC_STM32F411_MINIMUM_GPIO_H */
